servicemix-osgi/secure-proxy/1K_buyStocks_secure.xml

<?xml version="1.0" encoding="UTF-8"?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
<soapenv:Header><wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" soapenv:mustUnderstand="1"><xenc:EncryptedKey xmlns:xenc="http://www.w3.org/2001/04/xmlenc#" Id="id-1349385991767384000-1889024971"><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#rsa-1_5"/><ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#"><wsse:SecurityTokenReference><wsse:KeyIdentifier EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509SubjectKeyIdentifier">Xeg55vRyK3ZhAEhEf+YT0z986L0=</wsse:KeyIdentifier></wsse:SecurityTokenReference></ds:KeyInfo><xenc:CipherData><xenc:CipherValue>goujGhckhxhtuBm90f1jsxjZkaZ0dE9/y1EykxWZmE21X/1y3pBXZkbgeD6N2ICYYGSuUS0/Ykto
Yy765fCyKpW2l1xc3zIFsmVhZcF1UT+zeGS1RTqrPT4NYH+jeGBAGfIEtwSYZVgC3NsCNsKZoqV7
x+yy4tJf6O5icSPPQfc=</xenc:CipherValue></xenc:CipherData><xenc:ReferenceList><xenc:DataReference URI="#id-1349385991767539000-1794704864"/></xenc:ReferenceList></xenc:EncryptedKey><wsse:BinarySecurityToken EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="id-1349385991766989000-2001357679">MIIDDDCCAfSgAwIBAgIQM6YEf7FVYx/tZyEXgVComTANBgkqhkiG9w0BAQUFADAwMQ4wDAYDVQQK
DAVPQVNJUzEeMBwGA1UEAwwVT0FTSVMgSW50ZXJvcCBUZXN0IENBMB4XDTA1MDMxOTAwMDAwMFoX
DTE4MDMxOTIzNTk1OVowQjEOMAwGA1UECgwFT0FTSVMxIDAeBgNVBAsMF09BU0lTIEludGVyb3Ag
VGVzdCBDZXJ0MQ4wDAYDVQQDDAVBbGljZTCBnzANBgkqhkiG9w0BAQEFAAOBjQAwgYkCgYEAoqi9
9By1VYo0aHrkKCNT4DkIgPL/SgahbeKdGhrbu3K2XG7arfD9tqIBIKMfrX4Gp90NJa85AV1yiNsE
yvq+mUnMpNcKnLXLOjkTmMCqDYbbkehJlXPnaWLzve+mW0pJdPxtf3rbD4PS/cBQIvtpjmrDAU8V
sZKT8DN5Kyz+EZsCAwEAAaOBkzCBkDAJBgNVHRMEAjAAMDMGA1UdHwQsMCowKKImhiRodHRwOi8v
aW50ZXJvcC5iYnRlc3QubmV0L2NybC9jYS5jcmwwDgYDVR0PAQH/BAQDAgSwMB0GA1UdDgQWBBQK
4l0TUHZ1QV3V2QtlLNDm+PoxiDAfBgNVHSMEGDAWgBTAnSj8wes1oR3WqqqgHBpNwkkPDzANBgkq
hkiG9w0BAQUFAAOCAQEABTqpOpvW+6yrLXyUlP2xJbEkohXHI5OWwKWleOb9hlkhWntUalfcFOJA
gUyH30TTpHldzx1+vK2LPzhoUFKYHE1IyQvokBN2JjFO64BQukCKnZhldLRPxGhfkTdxQgdf5rCK
/wh3xVsZCNTfuMNmlAM6lOAg8QduDah3WFZpEA0s2nwQaCNQTNMjJC8tav1CBr6+E5FAmwPXP7pJ
xn9Fw9OXRyqbRA4v2y7YpbGkG2GI9UvOHw6SGvf4FRSthMMO35YbpikGsLix3vAsXWWi4rwfVOYz
QK0OFPNi9RMCUdSH06m9uLWckiCxjos0FQODZE9l4ATGy9s9hNVwryOJTw==</wsse:BinarySecurityToken><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:SignedInfo>
<ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
<ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/>
<ds:Reference URI="#id-1349385991763074000-970622364">
<ds:Transforms>
<ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
</ds:Transforms>
<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
<ds:DigestValue>t6I4G6P1pG630jReaJc6tUcmizM=</ds:DigestValue>
</ds:Reference>
<ds:Reference URI="#id-1349385991762563000-327324390">
<ds:Transforms>
<ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
</ds:Transforms>
<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
<ds:DigestValue>WpwUslk4San7QPyKbmtDV8Eh7EY=</ds:DigestValue>
</ds:Reference>
</ds:SignedInfo>
<ds:SignatureValue>
NkJBqJg5HUd0fXnI8tAGKR079Cc5VZ4NSqWXIHVR3l9HgMd6Q/AQ+ZtZh4sUffRmj7yK8G4ebCNY
tLH4oCnO5Y9PYzcMcRSoqgEiULZ03YyvFoKn9EWLtgdYohueV5dbE8en3FvQi0Yx4rHEuSNN8/Gq
z5Eagk/rs5bO41BbA1c=
</ds:SignatureValue>
<ds:KeyInfo><wsse:SecurityTokenReference><wsse:Reference URI="#id-1349385991766989000-2001357679" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3"/></wsse:SecurityTokenReference></ds:KeyInfo></ds:Signature><wsu:Timestamp xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="id-1349385991762563000-327324390"><wsu:Created>2012-10-04T21:26:31.762Z</wsu:Created><wsu:Expires>2012-11-03T21:26:31.762Z</wsu:Expires></wsu:Timestamp></wsse:Security><routing xmlns="http://someuri">xadmin;server1;community#1.0##</routing></soapenv:Header>
<soapenv:Body wsu:Id="id-1349385991763074000-970622364" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"><xenc:EncryptedData xmlns:xenc="http://www.w3.org/2001/04/xmlenc#" Id="id-1349385991767539000-1794704864" Type="http://www.w3.org/2001/04/xmlenc#Content"><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#aes128-cbc"/><ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<wsse:SecurityTokenReference xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"><wsse:Reference URI="#id-1349385991767384000-1889024971"/></wsse:SecurityTokenReference>
</ds:KeyInfo><xenc:CipherData><xenc:CipherValue>NcNx6Fbx8fKfYZxNDURvGCRif5tzISYJxa3UO4jeP0Lvu1N96tMneR1TZtGmqLc1FFLT5WIs17Q4
3m65MB6EO35KQH5CUBkGIBGUc2eWXAwiGBRHDLLlXH+iycPlqIQNnIGwCvbwRnaPTR/CvQMOxSBb
lvG51JLZQtPVLDF5HZxxNaK9Waz7cxKACVaBWCpOndrw52qbRCxQsm+sXBisBaLMXcS4b4y0rjFv
Mn8REsHdv/uvBV3nA81tQOXuIyOm7mZ9O020jOsh6nlwarS5p7Y/9X5mIJ+u0wcvAhSlM436aRDB
zMRfBcyznS5lYK6SvSFJJD+TENaO4FfLp6oVYi3ebNSL0O0aW3O8FO+fK09BZl/qUOl6W5eEXnds
dHFsUFMywzr75b/G8KHmyQ7f0nRY3e+cmrG3VWxId+aqOVt1Ix+kNANDSf50Ag5D/Hm+He33gLNE
ByS0HUMG1L5IcZZu02hUsea5dY43SokrQ+10oftFzoYf0ZUmkSnv1js617uSNc3Dbrkz1hPJch3G
Cepayrip3ERLlGAYM3KmkkYg0FAlb0LCjnd4adUk+Q8WZUIagk47i/VqusRK2yDB1ZS0La68s0Fd
TzI0+TIFXsRpcGOwPCcxldMApc6sXrkSrDIZdk4jIiJi/ewnrlxfxYi+UnYBK8m4Lpe7vAqplEIT
ryfEkMjLG+tG9nMyxXb866mR2EIXqM6CAmp5dpgYlZ7Y5s/HqzAwhgMm2aF4mdoD4rGUefIO7e0g
Ej4wbfi9+ckjZFtOqxD4ODNNSH0gHap9CK4kW+zScRLVk2T8aJTuyYXfhX9QumKFXu06AxOg4K7F
9DWDAZS0MIp1Zsh/eDOA36IvFx5j98iNr/JsYGbLSvxOyFWNgHEp/+V0c+C88c2ELWhlQ4BucKXl
SSEkk1y6ucK+EVR2q0Enjk52CLybfw4t84cuSTaoMhngyY4/BXhz+DibuU2mvkRTH7RFQAZf9fGG
Qp9mNu2Zfr3b+w50+qt/GUDCo4s6B/Mb4O4g6Z8LsFb3vuzBPtIN5YwYKJxgb0+O1jkE96C94SP+
q6Wqe8WMIxz81TgtvyvbR2+2</xenc:CipherValue></xenc:CipherData></xenc:EncryptedData></soapenv:Body>
</soapenv:Envelope>